Управление_гостиницами_EDT/src/Documents/КарточкаБронирования/КарточкаБронирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КарточкаБронирования</name>
  <registerRecords>InformationRegister.СтатусыНомеров</registerRecords>
  <registerRecords>AccumulationRegister.Выручка</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>InformationRegister.ЗанятостьНомеров</registerRecords>
  <registerRecords>InformationRegister.Задачи</registerRecords>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБронирования</name>
    <comment>Номер бронирования на сайте сервиса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусБрони</name>
    <type>
      <types>EnumRef.СтатусБрони</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникБронирования</name>
    <type>
      <types>CatalogRef.ИсточникиБронирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Взрослых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Детей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомераАвто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставБрони</name>
    <comment>Перечень номеров подлежащих бронированию</comment>
    <attributes>
      <name>Номер</name>
      <type>
        <types>CatalogRef.Номера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаезда</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыселения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаданаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.ДополнительныеУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Гости</name>
    <attributes>
      <name>Гость</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_гостиницами_EDT/src/InformationRegisters/СтатусыНомеров/СтатусыНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыНомеров</name>
  <comment>Заполняется статус брони номера по дням</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <comment>Статус номера (свободен, занят, забронирован)</comment>
    <type>
      <types>EnumRef.СтатусыНомеров</types>
    </type>
  </resources>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_гостиницами_EDT/src/InformationRegisters/ЗанятостьНомеров/ЗанятостьНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗанятостьНомеров</name>
  <comment>Регистрирует изменение статуса номера на начало и окончание периода бронирования (заселения)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <comment>Изменение статуса номера</comment>
    <type>
      <types>EnumRef.СтатусыНомеров</types>
    </type>
  </resources>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_гостиницами_EDT/src/AccumulationRegisters/Выручка/Выручка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Выручка</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_гостиницами_EDT/src/AccumulationRegisters/РасчетыСКлиентами/РасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектыРасчетовСКлиентами</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_гостиницами_EDT/src/Enums/СтатусыНомеров/СтатусыНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыНомеров</name>
  <enumValues>
    <name>Забронирован</name>
    <comment>На номер оформлена Бронь</comment>
  </enumValues>
  <enumValues>
    <name>Занят</name>
    <comment>На номер оформлено Заселение</comment>
  </enumValues>
  <enumValues>
    <name>Свободен</name>
  </enumValues>
</mdclass:Enum>

Управление_гостиницами_EDT/src/Enums/СтатусБрони/СтатусБрони.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусБрони</name>
  <enumValues>
    <name>Предварительная</name>
  </enumValues>
  <enumValues>
    <name>Подтверждена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Заселение</name>
  </enumValues>
</mdclass:Enum>

Управление_гостиницами_EDT/src/Documents/КарточкаБронирования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ УправлениеГостиницамиСервер.ЭтоГостиничныйКомплекс(Гостиница) Тогда
	
		НомерЭлемента = ПроверяемыеРеквизиты.Найти("Корпус");
		Если НЕ НомерЭлемента = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерЭлемента);
		КонецЕсли; 
		
	КонецЕсли;     
КонецПроцедуры

Функция ПолучитьКонфликтныеДанные(Номер,Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыНомеров.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.СтатусыНомеров КАК СтатусыНомеров
		|ГДЕ
		|	СтатусыНомеров.Номер = &Номер
		|	И СтатусыНомеров.Дата = &Дата";
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("Дата",Дата);	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Регистратор;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	//Определим текущие статусы номеров для записи
	
	СтатусНомераЗанят = Перечисления.СтатусыНомеров.Забронирован;
	СтатусНомераСвободен = Перечисления.СтатусыНомеров.Свободен;
	Если СтатусБрони = Перечисления.СтатусБрони.Отменена Тогда
		СтатусНомераЗанят = Перечисления.СтатусыНомеров.Свободен;	
	ИначеЕсли СтатусБрони = Перечисления.СтатусБрони.Заселение Тогда
		СтатусНомераЗанят = Перечисления.СтатусыНомеров.Занят;	
	КонецЕсли; 
	
	//Движения выполняемые при условии, что бронь не была отменена
	Если НЕ СтатусБрони = Перечисления.СтатусБрони.Отменена Тогда 
		
		// регистр СтатусыНомеров
		
		Движения.СтатусыНомеров.Записывать = Истина;
		Для Каждого ТекСтрокаСоставБрони Из СоставБрони Цикл
			Для Приращение = 0 По ТекСтрокаСоставБрони.КоличествоДней - 1 Цикл

				ДатаСтатуса = РаботаСДатамиКлиентСервер.ПрибавитьДень(ТекСтрокаСоставБрони.ДатаЗаезда, Приращение);
				Если Не НачалоДня(ДатаСтатуса) = НачалоДня(ДатаВыселения) Тогда //Для дня выселения статус занятости не устанавливаем

					Движение = Движения.СтатусыНомеров.Добавить();
					Движение.Гостиница = Гостиница;
					Движение.Номер = ТекСтрокаСоставБрони.Номер;
					Движение.Дата = ДатаСтатуса;
					Движение.Корпус = Корпус;
					Движение.Статус = СтатусНомераЗанят;
					
				КонецЕсли;

			КонецЦикла;

		КонецЦикла;
		
		
		// регистр ЗанятостьНомеров
		//Регистрирует изменение статуса номера на начало и окончание периода бронирования (заселения)
		Движения.ЗанятостьНомеров.Записывать = Истина;
		
		ТаблицаСоставаБрони = СоставБрони.Выгрузить();
		СписокНомеров = СоставБрони.Выгрузить(,"Номер");
		СписокНомеров.Свернуть("Номер");
		МассивНомеров = СписокНомеров.ВыгрузитьКолонку("Номер");
		МассивДвижений = Новый Массив;
		Для каждого ТекущийНомер Из МассивНомеров Цикл
							
			НайденыеСтроки = ТаблицаСоставаБрони.НайтиСтроки(Новый Структура("Номер",ТекущийНомер));
			ДанныеДвижения = Новый Структура();
			Для каждого СтрокаБрони Из НайденыеСтроки Цикл
			
				Если ДанныеДвижения.Свойство("ДатаСвободен") Тогда
				  	Если СтрокаБрони.ДатаЗаезда = ДанныеДвижения.ДатаСвободен + 1 Тогда
					    Если СтрокаБрони.ДатаВыселения = ДатаВыселения Тогда
							//Установим дату и время выселения на конец предыдущего дня пока я не придумаю что то еще						
							ДанныеДвижения.ДатаСвободен = НачалоДня(СтрокаБрони.ДатаВыселения)	- 1;
						Иначе
							ДанныеДвижения.ДатаСвободен = КонецДня(СтрокаБрони.ДатаВыселения);
						КонецЕсли;
					Иначе
						МассивДвижений.Добавить(ДанныеДвижения);
						ДанныеДвижения = Новый Структура;                 
						ДанныеДвижения.Вставить("Номер",СтрокаБрони.Номер);
						ДанныеДвижения.Вставить("ДатаЗанят",СтрокаБрони.ДатаЗаезда);
						ДатаСвободен = ?(СтрокаБрони.ДатаВыселения = ДатаВыселения,НачалоДня(СтрокаБрони.ДатаВыселения)	- 1,КонецДня(СтрокаБрони.ДатаВыселения));
						ДанныеДвижения.Вставить("ДатаСвободен",ДатаСвободен);
					КонецЕсли;
				Иначе
					ДанныеДвижения.Вставить("Номер",СтрокаБрони.Номер);
					ДанныеДвижения.Вставить("ДатаЗанят",СтрокаБрони.ДатаЗаезда);
					ДатаСвободен = ?(СтрокаБрони.ДатаВыселения = ДатаВыселения,НачалоДня(СтрокаБрони.ДатаВыселения)	- 1,КонецДня(СтрокаБрони.ДатаВыселения));
					ДанныеДвижения.Вставить("ДатаСвободен",ДатаСвободен);	
				КонецЕсли;
				
				
			
			КонецЦикла;
			МассивДвижений.Добавить(ДанныеДвижения);
			
		КонецЦикла;
		
		
		Для Каждого ДанныеДвижения Из МассивДвижений Цикл
			//Запишем период занятости номера
			Движение = Движения.ЗанятостьНомеров.Добавить();
			Движение.Период = ДанныеДвижения.ДатаЗанят;
			Движение.Гостиница = Гостиница;
			Движение.Корпус = Корпус;
			Движение.Номер = ДанныеДвижения.Номер;
			Движение.Статус = СтатусНомераЗанят;
			//Запишем период освобождения номера
			Движение = Движения.ЗанятостьНомеров.Добавить();
			Движение.Период = ДанныеДвижения.ДатаСвободен;
			Движение.Гостиница = Гостиница;
			Движение.Корпус = Корпус;
			Движение.Номер = ДанныеДвижения.Номер;
			Движение.Статус = СтатусНомераСвободен;
		КонецЦикла;
		
		// регистр Выручка Приход
		Движения.Выручка.Записывать = Истина;
		Для Каждого ТекСтрокаСоставБрони Из СоставБрони Цикл
			Движение = Движения.Выручка.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ДатаВыселения;
			Движение.Гостиница = Гостиница;
			Движение.Корпус = Корпус;
			Движение.Номер = ТекСтрокаСоставБрони.Номер;
			Движение.Сумма = ТекСтрокаСоставБрони.Сумма;
		КонецЦикла;
		
		// регистр РасчетыСКлиентами Расход
		Движения.РасчетыСКлиентами.Записывать = Истина;
		Движение = Движения.РасчетыСКлиентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.ОбъектРасчетов = Ссылка;
		Движение.Сумма = СуммаДокумента;
		
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#КонецЕсли
